01-ahmed-body/cases/slant00_re4.18M_symtest_transient/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;
solver          incompressibleFluid;

// First verification run for this transient case: small endTime to
// confirm the setup actually works (correct startup, reasonable
// Courant behavior, no immediate blowup) before committing to a long
// run. Matches the 25deg transient case's staged-extension approach.
// Starting from UNIFORM initial conditions in 0/ (NOT resuming from
// the steady case's 2000/ result) -- per the documented SIMPLEC->
// PIMPLE phi-field incompatibility found during the 25deg transient
// conversion.
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         0.45;

// deltaT computed from THIS mesh's actual finest cell size (not
// assumed from the 25deg case): dx=1.003mm (direct cell-extent
// measurement, smaller/more conservative than the volume-based cube-
// root estimate of 1.493mm -- smallest cells are somewhat
// anisotropic). U=60 m/s (freestream, not local-accelerated velocity
// -- simpler starting choice, adjustTimeStep will correct quickly if
// too large). Target Co=0.5.
// deltaT = 0.5 * 1.003e-3 / 60 = 8.358e-06 s
// (scripts/compute_transient_deltat.py)
deltaT          8.358e-06;
adjustTimeStep  yes;
maxCo           0.5;

writeControl    adjustableRunTime;
writeInterval   0.001;

purgeWrite      2;

writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    #include "forceCoeffs"
}

// ************************************************************************* //
