01-ahmed-body/cases/slant00_re4.18M_symtest_transient/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    ground
    {
        // Wall-function treatment, consistent with the Ahmed body
        // (see README decision record). Target y+ 30-300.
        type            nutkWallFunction;
        value           uniform 0;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    symmetryPlane
    {
        type            symmetryPlane;
    }
    farfield
    {
        type            calculated;
        value           uniform 0;
    }
    ahmedBody
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}
// ************************************************************************* //
