01-ahmed-body/cases/slant00_re4.18M_symtest_transient/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];
internalField   uniform $turbulentOmega;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    ground
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    top
    {
        type            slip;
    }
    symmetryPlane
    {
        type            symmetryPlane;
    }
    farfield
    {
        type            slip;
    }
    ahmedBody
    {
        type            omegaWallFunction;
        value           $internalField;
    }
}
// ************************************************************************* //
