01-ahmed-body/cases/slant00_re4.18M_symtest_transient/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces ("ahmedBody.stl");

// FINAL for 0deg case, verified via geometric inspection.
// Sweep across includedAngle=89-150 (scripts/sweep_included_angle.py)
// showed: 89deg -> 0 edges; 90deg -> 8 edges (4 rear box corners +
// 4 fillet-to-flat tangent-line corners, both confirmed genuine via
// point-coordinate inspection, not tessellation noise); 91deg+ ->
// edge count climbs continuously with no plateau (fillet tessellation
// noise entering with no clean separation point). 90deg is the unique
// value capturing all real geometric features with zero noise.
includedAngle   90;

subsetFeatures
{
    nonManifoldEdges    yes;
    openEdges           yes;
}

// ************************************************************************* //
